[
  {
    "id": 1,
    "title": "Quick and Easy Dinner Ideas",
    "summary": "Delicious and simple dinner recipes for busy weeknights.",
    "content": "Yoğun bir günün ardından hızlı ve lezzetli bir akşam yemeği hazırlamak bazen zor olabilir. Ancak, pratik tariflerle bu süreci kolaylaştırmak mümkündür. Bu yazıda, hafta içi yoğun günler için hızlı ve kolay akşam yemeği fikirlerini paylaşacağız.\n\n1. Tavuklu Sebzeli Makarna: Tavuk göğsünü küçük parçalara ayırın ve zeytinyağında soteleyin. Doğranmış sebzeleri (örneğin, biber, kabak ve mantar) ekleyin ve karıştırarak pişirin. Haşlanmış makarnayı tavuk ve sebzelerle karıştırarak lezzetli bir sos ekleyin. Üzerine rendelenmiş parmesan peyniri serperek servis yapın.\n\n2. Avokado ve Izgara Tavuklu Salata: Izgara tavuk göğsünü dilimleyin ve doğranmış avokado, cherry domates, salatalık ve marul ile karıştırın. Zeytinyağı, limon suyu, tuz ve karabiberle hazırladığınız sosu salatanın üzerine dökün. Sağlıklı ve doyurucu bir akşam yemeği için mükemmel bir seçenektir.\n\n3. Fırında Somon ve Kuşkonmaz: Somon filetosunu tuz, karabiber ve limon suyu ile marine edin. Kuşkonmazları zeytinyağı ve baharatlarla karıştırın. Somon ve kuşkonmazı fırın tepsisine yerleştirerek 200 derecede yaklaşık 15-20 dakika pişirin. Yanında haşlanmış patates veya kinoa ile servis yapabilirsiniz.\n\n4. Tavuklu Quesadilla: Tortilla ekmeğinin üzerine rendelenmiş cheddar peyniri, doğranmış tavuk göğsü ve biber dilimleri ekleyin. Üzerine başka bir tortilla ekmeği kapatın ve her iki tarafını da tavada kızartın. Dilimleyerek yanında guacamole ve salsa sos ile servis yapın.\n\n5. Mercimek Çorbası: Kırmızı mercimeği yıkayıp süzün ve tencereye alın. Üzerine doğranmış soğan, havuç ve patates ekleyin. Sıcak su ve tuz ekleyerek mercimekler yumuşayana kadar pişirin. Blenderdan geçirerek pürüzsüz bir kıvam elde edin. Üzerine tereyağında kızdırılmış pul biber ekleyerek servis yapın.\n\nBu hızlı ve kolay tarifler, yoğun günlerde bile lezzetli ve besleyici akşam yemekleri hazırlamanıza yardımcı olacaktır. Denemenizi ve sevdiklerinizle paylaşmanızı öneririm.",
    "author": "Şef Elif",
    "date": "2 Ocak 2025",
    "image": "/images/quick_dinner.jpg"
  }
  
]
